       IDENTIFICATION DIVISION.
       PROGRAM-ID. Divisiones.
       DATA DIVISION.
        FILE SECTION.
         WORKING-STORAGE SECTION.
          

       PROCEDURE DIVISION.
           GOBACK.